other_files/OpenFOAM_Sample_Files/innerflow/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  | Generated by: Butterfly 0.0.1                   |
|                           | https://github.com/mostaphaRoudsari/Butterfly/  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.2;
	format		ascii;
	class		dictionary;
	object		blockMeshDict;
}

convertToMeters 1;

vertices
(
(13.65 -8.4 8.0)
(-0.65000000000000036 -8.4 0.0)
(13.65 -21.6 8.0)
(-0.65000000000000036 -21.6 0.0)
(13.65 -8.4 0.0)
(-0.65000000000000036 -8.4 8.0)
(13.65 -21.6 0.0)
(-0.65000000000000036 -21.6 8.0)
);

blocks
(
   hex (3 1 4 6 7 2 0 5) (1 1 1) simpleGrading (1.0 1.0 1.0)
);

edges
(
);

boundary
(   boundingbox
   {
       type wall;
       faces
       (
            (3 6 2 7)
            (6 4 0 2)
            (4 1 5 0)
            (1 3 7 5)
            (6 3 1 4)
            (7 2 0 5)
       );
   }
);

mergePatchPair
(
);
