other_files/OpenFOAM_Sample_Files/innerflow/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             steadyState;
}

gradSchemes
{
    default 		cellLimited leastSquares 1;
}

divSchemes
{
   default none;
    div(phi,U)          bounded Gauss linearUpwindV grad(U); //cellLimited Gauss linear 1;
    div(phi,epsilon)    bounded Gauss linearUpwind grad(epsilon);//cellLimited Gauss linear 1;
    div(phi,k)          bounded Gauss linearUpwind grad(k);//cellLimited Gauss linear 1;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear limited corrected 0.333;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             limited corrected 0.333;
}

fluxRequired
{
    default             no;
    p			;
}


// ************************************************************************* //
